{
    "architectures": [
        "LlamaForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 128000,
    "torch_dtype": "float16",
    "eos_token_id": 128009,
    "head_dim": 64,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 8192,
    "max_position_embeddings": 131072,
    "mlp_bias": false,
    "model_type": "llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 16,
    "num_key_value_heads": 8,
    "pad_token_id": 128004,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_parameters": {
        "rope_theta": 500000.0,
        "rope_type": "default"
    },
    "tie_word_embeddings": true,
    "unsloth_fixed": true,
    "unsloth_version": "2026.3.8",
    "use_cache": false,
    "vocab_size": 128256
}